isc-fs/IFS08-CE-DASH/Firmware/FlashLoader/MT25QL128A_STM32H743_CUSTOM7_SRC/Sources/Loader_Files/Loader_Src.c
/* Porting note:
 * Base template copied from ST's N25Q256A STM32L476 example.
 * This working copy is being adapted toward MT25QL128A on STM32H743
 * with CUSTOM7 pinout: PB2 CLK, PB10 NCS, PF8 IO0, PF9 IO1, PF7 IO2, PF6 IO3.
 * The flash geometry and pin mapping below already reflect the target design,
 * but the low-level peripheral layer is still the legacy STM32L4 QSPI library.
 */
/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_quadspi.h"
#include "stm32l4xx_rcc.h"
#include "stm32l4xx_conf.h"
#include "stm32l4xx_syscfg.h"

/* Private typedef -----------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
#define QSPI_DDRMODE
#define QSPI_PAGESIZE                256
#define IO_READ_DDR_QUAD_CMD         0xED
#define IO_READ_QUAD_CMD             0xEB
#define WRITE_ENABLE_CMD             0x06
#define READ_STATUS_REGISTER_CMD     0x05
#define FAST_PROGRAM_CMD             0x32
#define SECTOR_ERASE_CMD             0xD8
#define ENTER_4B_ADDR_CMD            0xB7
#define EXIT_4B_ADDR_CMD             0xE9

#define RSTEN_CMD                    0x66
#define RST_CMD                      0x99
#define QUADSPI_ComConfig_ADSIZE 		      QUADSPI_ComConfig_ADSize_32bit;

static void ResetMemory(void);
extern void SystemInit(void);

/*******************************************************************************
 Description :																		
 Configuration of the QUADSPI		                  
 Inputs 	:																				
 				 None 																		
 outputs 	:																				
 				 None 																		
********************************************************************************/
void QUADSPI_Config(void)
{
  QUADSPI_InitTypeDef QUADSPI_InitStructure;
  QUADSPI_DeInit();

  QUADSPI_InitStructure.QUADSPI_SShift = QUADSPI_SShift_NoShift;
  QUADSPI_InitStructure.QUADSPI_Prescaler = 0x0;//0x6;
  QUADSPI_InitStructure.QUADSPI_CKMode = QUADSPI_CKMode_Mode0;
  QUADSPI_InitStructure.QUADSPI_CSHTime = QUADSPI_CSHTime_1Cycle;
  /* 16 MiB external flash => 24 address bits => FSIZE = 23 (0x17). */
  QUADSPI_InitStructure.QUADSPI_FSize = 0x17;
  QUADSPI_Init(&QUADSPI_InitStructure); 
	
  QUADSPI_Cmd(ENABLE);
}

/*******************************************************************************
 Description :																		
 QUADSPI Memory Mapped mode configuration 		    
 Inputs 	:																				
 				 None 																		
 outputs 	:																				
 				 None 																		
********************************************************************************/
void QUADSPI_MappedMode()
{
 QUADSPI_ComConfig_InitTypeDef QUADSPI_ComConfig_InitStructure;
	
#ifdef QSPI_DDRMODE
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_DDRMode = QUADSPI_ComConfig_DDRMode_Enable;
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_Ins = IO_READ_DDR_QUAD_CMD ;
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_DummyCycles  = 8;
#else
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_DDRMode = QUADSPI_ComConfig_DDRMode_Disable;
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_Ins = IO_READ_QUAD_CMD
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_DummyCycles  = 10;
#endif /* QSPI_DDRMODE */

  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_SIOOMode = QUADSPI_ComConfig_SIOOMode_Disable;
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_ABSize = QUADSPI_ComConfig_ABSize_8bit;
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_ABMode = QUADSPI_ComConfig_ABMode_NoAlternateByte;
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_FMode = QUADSPI_ComConfig_FMode_Memory_Mapped;
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_ADMode = QUADSPI_ComConfig_ADMode_4Line;
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_ADSize = QUADSPI_ComConfig_ADSize_32bit;
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_DMode = QUADSPI_ComConfig_DMode_4Line;
  QUADSPI_ComConfig_InitStructure.QUADSPI_ComConfig_IMode = QUADSPI_ComConfig_IMode_1Line;
	
  QUADSPI_ComConfig_Init(&QUADSPI_ComConfig_InitStructure); 

  /* Remap QUADSPI on zero address */
  SYSCFG_ExternalMemorySwapping(ENABLE);
}

/*******************************************************************************
 Description :																		
 Clock and GPIO configuration 		                
 Inputs 	:																				
 				 None 																		
 outputs 	:																				
 				 None 																		
********************************************************************************/
void GPIO_Clock_Config(void)
{
	GPIO_InitTypeDef  GPIO_InitStructure;
	
   /* Enable QUADSPI Clock*/
  RCC_AHB3PeriphClockCmd(RCC_AHB3Periph_QSPI,ENABLE);

  /* Enable GPIO AHB2 clock */
   RCC_AHB2PeriphClockCmd(RCC_AHB2Periph_GPIOB|RCC_AHB2Periph_GPIOF,ENABLE);
   
   /* Enable APB2 clock */
   RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG,ENABLE);
   
/* GPIO confi 1 */
//   GPIO_PinAFConfig(GPIOE,GPIO_PinSource15,GPIO_AF_QSPI);
//   GPIO_PinAFConfig(GPIOE,GPIO_PinSource14,GPIO_AF_QSPI);
//   GPIO_PinAFConfig(GPIOE,GPIO_PinSource13,GPIO_AF_QSPI);
//   GPIO_PinAFConfig(GPIOE,GPIO_PinSource12,GPIO_AF_QSPI);
//   GPIO_PinAFConfig(GPIOE,GPIO_PinSource10,GPIO_AF_QSPI);
//   GPIO_PinAFConfig(GPIOE,GPIO_PinSource11,GPIO_AF_QSPI);
//   
//   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
//   GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
//   GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
//   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
//   
//   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
//   GPIO_Init(GPIOE,& GPIO_InitStructure);
//   
//   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;
//   GPIO_Init(GPIOE,& GPIO_InitStructure);
//   
//   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
//   GPIO_Init(GPIOE,& GPIO_InitStructure);
//   
//   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
//   GPIO_Init(GPIOE,& GPIO_InitStructure);
//   
//   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
//   GPIO_Init(GPIOE,& GPIO_InitStructure);
//   
//   GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
//   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
//   GPIO_Init(GPIOE,& GPIO_InitStructure); 

/* CUSTOM7 target pinout:
 * PB2  -> CLK
 * PB10 -> NCS
 * PF8  -> IO0
 * PF9  -> IO1
 * PF7  -> IO2
 * PF6  -> IO3
 */
   GPIO_PinAFConfig(GPIOB,GPIO_PinSource2,GPIO_AF_QSPI);
   GPIO_PinAFConfig(GPIOB,GPIO_PinSource10,GPIO_AF_QSPI);
   GPIO_PinAFConfig(GPIOF,GPIO_PinSource8,GPIO_AF_QSPI);
   GPIO_PinAFConfig(GPIOF,GPIO_PinSource9,GPIO_AF_QSPI);
   GPIO_PinAFConfig(GPIOF,GPIO_PinSource7,GPIO_AF_QSPI);
   GPIO_PinAFConfig(GPIOF,GPIO_PinSource6,GPIO_AF_QSPI);
   
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
   GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
   GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
   
