isc-fs/IFS08-CE-DASH/Firmware/FlashLoader/MT25QL128A_STM32H743_CUSTOM7_SRC/Sources/Loader_Files/Loader_Src.c
      if (NumOfSingle != 0)
      {
        QSPI_DataNum = NumOfSingle;
        
        QSPI_WritePage(Address, QSPI_DataNum, buffer);
      }
    }
  }

	return 1;
}

/*******************************************************************************
 Description :																			
 Erase a full sector in the device 									
 Inputs :																					  
 				SectrorAddress	: Start of sector 					
 outputs :																				  
 				"1" : Operation succeeded										
 				"0" : Operation failure											
 Note : Not Mandatory for SRAM PSRAM and NOR_FLASH		
********************************************************************************/
int SectorErase (uint32_t EraseStartAddress ,uint32_t EraseEndAddress)
{      
	uint32_t BlockAddr;
	EraseStartAddress = EraseStartAddress -  EraseStartAddress % 0x10000;
	
	while (EraseEndAddress>=EraseStartAddress)
	{
		BlockAddr = EraseStartAddress & 0x0FFFFFFF;
		QUADSPI_EraseSector( BlockAddr);
    EraseStartAddress += 0x10000;
	}
 	return 1;	
}

/*******************************************************************************
 Description :																			
 Read data from the device	 														
 Inputs :																					
 				Address 	: Write location  										
 				Size 		: Length in bytes 										
 				buffer 		: Address where to get the data to write		
 outputs :																				
 				"1" 		: Operation succeeded								
 				"0" 		: Operation failure										
 Note : Not Mandatory                               
********************************************************************************/	
int Read (uint32_t Address, uint32_t Size, uint8_t* Buffer)
{     	
	int i = 0;
	
	QUADSPI_MappedMode();
	
	for (i=0; i < Size;i++)
	{ 
		*(uint8_t*)Buffer++ = *(uint8_t*)Address;
		Address ++;
	}
   
	return 1;     
} 

/*******************************************************************************
 Description :																		
 Verify the data 	 														    
 Inputs :																					
 				MemoryAddr 	: Write location  					
 				RAMBufferAddr 	: RAM Address		          
 				Size 		: Length in bytes 								
 outputs :																				
 				"0" 		: Operation succeeded						
 Note : Not Mandatory                             	
********************************************************************************/
int Verify (uint32_t MemoryAddr, uint32_t RAMBufferAddr, uint32_t Size)
{ 
	uint32_t VerifiedData = 0;
	Size*=4;
        
  QUADSPI_MappedMode();
	
  while (Size>VerifiedData)
  {
		if ( *(uint8_t*)MemoryAddr++ != *((uint8_t*)RAMBufferAddr + VerifiedData))
			return (MemoryAddr + VerifiedData);  
		
		VerifiedData++;  
  }
        
  return 0;
}
/*******************************************************************************
 Description :																		
 System initialization										        
 Inputs 	:																        
 				 None 																		
 outputs 	:																				
 				"1" 		: Operation succeeded						
 				"0" 		: Operation failure							
********************************************************************************/
int Init (void)
{ 
  SystemInit();

  GPIO_Clock_Config();

  QUADSPI_Config();

  /* Reset memory config */
  ResetMemory();

  /* Enable 4 Byte Addressing Mode */
  while(QUADSPI_GetFlagStatus(QUADSPI_FLAG_BUSY)==SET);
  QSPI_WriteEnable();
  QSPI_SendInstruction(0xB7); // Send 4 Byte Addressing Mode instruction

  return 1;
}

static void ResetMemory()
{
/* Reset memory config, Cmd in 1 line */
    /* Send RESET ENABLE command (0x66) to be able to reset the memory registers */
    while(QUADSPI->SR & 0x20);  /* Wait for busy flag to be cleared */
    QUADSPI->CCR = 0x2166;
    QUADSPI->AR = 0;
    QUADSPI->ABR = 0;
    QUADSPI->DLR = 0;
    __DSB(); 
     
     /* Send RESET command (0x99) to reset the memory registers */
    while(QUADSPI->SR & 0x20);  /* Wait for busy flag to be cleared */
    QUADSPI->CCR = 0x2199;
    QUADSPI->AR = 0;
    QUADSPI->ABR = 0;
    QUADSPI->DLR = 0;
    __DSB();

/* Reset memory config, Cmd in 2 lines*/
    /* Send RESET ENABLE command (0x66) to be able to reset the memory registers */
    while(QUADSPI->SR & 0x20);  /* Wait for busy flag to be cleared */
    QUADSPI->CCR = 0x2266;
    QUADSPI->AR = 0;
    QUADSPI->ABR = 0;
    QUADSPI->DLR = 0;
    __DSB(); 
     
     /* Send RESET command (0x99) to reset the memory registers */
    while(QUADSPI->SR & 0x20);  /* Wait for busy flag to be cleared */
    QUADSPI->CCR = 0x2299;
    QUADSPI->AR = 0;
    QUADSPI->ABR = 0;
    QUADSPI->DLR = 0;
    __DSB();
    
      /* Reset memory config, Cmd in 4 lines*/
    /* Send RESET ENABLE command (0x66) to be able to reset the memory registers */
    while(QUADSPI->SR & 0x20);  /* Wait for busy flag to be cleared */
    QUADSPI->CCR = 0x2366;
    QUADSPI->AR = 0;
    QUADSPI->ABR = 0;
    QUADSPI->DLR = 0;
    __DSB(); 
     
     /* Send RESET command (0x99) to reset the memory registers */
    while(QUADSPI->SR & 0x20);  /* Wait for busy flag to be cleared */
    QUADSPI->CCR = 0x2399;
    QUADSPI->AR = 0;
    QUADSPI->ABR = 0;
    QUADSPI->DLR = 0;
    __DSB();
}
